Revit 2024 API
BuiltInFailures.SketchFailures.FloorManyDirectionCurves Property
 More than one span direction curve specified.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FloorManyDirectionCurves { get; }
Visual Basic
Public Shared ReadOnly Property FloorManyDirectionCurves As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FloorManyDirectionCurves {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace